doc/create-tables.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-06-22 Tue 13:40 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Creating Tables</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Sabra Crolleton">
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Creating Tables</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#54ddf54b-c26b-4242-a996-0e803aeb9801">Introduction to Table Creation in Postmodern</a></li>
<li><a href="#14330eed-440e-4f07-ab6f-5e2711ef4002">Basic Postgresql Database Tables</a></li>
<li><a href="#1d23daae-8768-40c7-80ce-61c95b9d4aea">Postmodern Create-Table</a></li>
<li><a href="#c390e5db-0539-4bfa-b7b6-9b38dcdd9ae2">S-SQL Create-Table</a>
<ul>
<li><a href="#efb71d2a-2318-47d3-8f04-b5fe2172178d">Table Names Parameter</a>
<ul>
<li><a href="#034f548e-0318-40fc-90c5-63fb310936e4">Temporary and Unlogged Tables</a></li>
</ul>
</li>
<li><a href="#df4fd2b0-1928-4fa9-9c70-c2060cdec5ff">Using Identity Columns</a></li>
<li><a href="#3b09fa31-255b-4769-9d8f-085201e66a02">Array Columns</a></li>
<li><a href="#205f09d2-9357-4512-949a-3dcaaae6808f">Check Constraints</a></li>
<li><a href="#e2ed3fbc-6193-4db8-b2ea-cf29d0fe849e">Unique Constraints</a></li>
<li><a href="#7d0b525b-827f-41db-8523-e62da8fbe52b">Timestamps with and without timezones</a></li>
<li><a href="#05423b5d-c101-4244-bc7e-5b05e257d03a">Adding Foreign Keys</a>
<ul>
<li><a href="#5bc3ebb3-b34c-4490-b4d4-a3d404b636a7">Defining Foreign Keys at the Column Level</a></li>
<li><a href="#7d033701-5e20-43b7-9142-2cf5c1e50317">Defining Foreign Keys at the Table Level</a></li>
</ul>
</li>
<li><a href="#1aff79ef-749e-4229-82e4-81dceabb72b5">Using Tablespaces</a></li>
<li><a href="#015c6b92-dd5f-400b-bd8d-d2d08e76a166">Partitions (not fully implemented)</a></li>
</ul>
</li>
<li><a href="#org6b881c7">Table Creation With Dao Classes</a></li>
</ul>
</div>
</nav>

<div id="outline-container-54ddf54b-c26b-4242-a996-0e803aeb9801" class="outline-2">
<h2 id="54ddf54b-c26b-4242-a996-0e803aeb9801">Introduction to Table Creation in Postmodern</h2>
<div class="outline-text-2" id="text-54ddf54b-c26b-4242-a996-0e803aeb9801">
<p>
Postmodern offers multiple ways to create postgresql database tables. Which one
you choose depends on two things:
</p>

<ul class="org-ul">
<li>Do you start by creating <a href="dao-classes.html">dao classes</a> first or are you even using dao classes?
If yes, then also see <a href="dao-classes.html#table-definition">Creating Tables using dao classes</a></li>

<li>Databases are data and transaction management systems, not just data storage. How much detailed table specification do you need?</li>
</ul>

<p>
If you typically start with defining your classes and only need
relatively straight-forward tables with simple primary and foreign keys,
then you would define your daos first, then let postmodern's deftable and
create-table functions to create the database classes.
</p>

<p>
If you do not use daos or need more control and you want to use postmodern's
more lispy syntax as compared to postgresql's never ending natural language
statements, you can reach for one of two additional tools: the
sql-operators :create-table and :create-extended-table. The api signature
differs slightly in order to ensure backwards compatibility and, as you might
expect, :create-extended-table gives you more options.
</p>

<p>
But first we should talk about basic database table creation and why do we care
about different options.
</p>
</div>
</div>

<div id="outline-container-14330eed-440e-4f07-ab6f-5e2711ef4002" class="outline-2">
<h2 id="14330eed-440e-4f07-ab6f-5e2711ef4002">Basic Postgresql Database Tables</h2>
<div class="outline-text-2" id="text-14330eed-440e-4f07-ab6f-5e2711ef4002">
<p>
The full postgresql sql specification can be found <a href="https://www.postgresql.org/docs/current/static/sql-createtable.html">here</a>.
</p>

<p>
At a bare minimum, a database table needs a name. If you actually want to store
data in it, you need to define the columns (some people call them fields).
Again, at a minimum, a column needs a name, a datatype and whether the column
can be a null or whether the database will require that the field have a value.
</p>

<p>
Once you provide these bare minimum definitions to the database, then you can
start inserting rows (or tuples) into the table.
</p>

<p>
For purposes of all the examples below, we will assume that you have a connection
to a database. That can be a toplevel connection or wrapping a connection around
your query, and either of these can be directly to the database or through a
connection pooling mechanism. This page will just be dealing with the queries
required to create a postgresql database table.
</p>
</div>
</div>

<div id="outline-container-1d23daae-8768-40c7-80ce-61c95b9d4aea" class="outline-2">
<h2 id="1d23daae-8768-40c7-80ce-61c95b9d4aea">Postmodern Create-Table</h2>
<div class="outline-text-2" id="text-1d23daae-8768-40c7-80ce-61c95b9d4aea">
</div>
</div>

<div id="outline-container-c390e5db-0539-4bfa-b7b6-9b38dcdd9ae2" class="outline-2">
<h2 id="c390e5db-0539-4bfa-b7b6-9b38dcdd9ae2">S-SQL Create-Table</h2>
<div class="outline-text-2" id="text-c390e5db-0539-4bfa-b7b6-9b38dcdd9ae2">
<p>
At this minimum level, the :create-table and :create-extended-table calls are
exactly the same. Let's walk through a simple example:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-table</span> 'films-at-eleven
          ((code <span style="color: #23d7d7;">:type</span> (or (string 5) db-null) <span style="color: #23d7d7;">:constraint</span> 'firstkey <span style="color: #23d7d7;">:primary-key</span> t)
           (title <span style="color: #23d7d7;">:type</span> (varchar 40))
           (did <span style="color: #23d7d7;">:type</span> integer)
           (date-prod <span style="color: #23d7d7;">:type</span> (or date db-null))
           (kind <span style="color: #23d7d7;">:type</span> (or (varchar 10) db-null))
           (len <span style="color: #23d7d7;">:type</span> (or interval db-null) <span style="color: #23d7d7;">:interval</span> <span style="color: #23d7d7;">:hour-to-minute</span>))))

</pre>
</div>
<p>
The parameter specification is :create-table (name (&amp;rest columns) &amp;rest options)
</p>

<p>
The first parameter is the name of the new table. You could make the name a quoted
string, e.g. "films-at-eleven", but postmodern will handle either a string or the
unquoted parameter provided above. Postmodern will also automatically handle the
conversion of the hyphens so beloved by common lisp programmers to the underscores
demanded by the sql specification.
</p>

<p>
The next form contains subforms for each column in the table.
</p>

<p>
The first parameter being the name of the column.
</p>

<p>
As you know, postgresql will enforce the data type for the column. So, the
next keyword specifies that type to follow. You can see several different types
specified in this table. Look at the type for 'code'. It specifies that the
data will be either NULL or a string with a maximum length of 5 characters.
</p>

<p>
Compare that against the type specifiers for title or did. In both of those
cases, the column entry is not allowed to be NULL, it must have a value. In
this example the title must be a string with a length no greater than 40
characters. (For most purposes, you can treat a string specification the
same as a varchar specification.
</p>

<p>
The did type specification mandates an integer - trying to put a float in that
column will trigger a database type error.
</p>

<p>
The date-prod column obviously has a date data type and the len column has
a interval data type, intervals being a period of time rather than a specific
time.
</p>

<p>
The code column also has a constraint - It is the primary key for indexing the table
and that contraint has a name - in this case 'firstkey. If you do not name the
constraint, the system will name it for you.
</p>

<p>
The len column also has additional information. It is an interval of time; That
could encompass years as well as seconds. The specification given here,
:hour-to-minute means that the database will only keep the hours to minutes part
of the potential time interval.
</p>
</div>
