doc/create-tables.org
** Table Names Parameter
   :PROPERTIES:
   :ID:       a33bcc61-0866-4de5-85c5-63c48550ec5f
   :CUSTOM_ID: efb71d2a-2318-47d3-8f04-b5fe2172178d
   :END:
The following discussion on table names is the same for both :create-table
or :create-extended table.

Create-table works with either the simple name for the table parameter or the
name can be wrapped in a form. There are a few acceptable ways to pass the
table-name parameters. We recommend a single quote as in the first example
below, but for backwards compatibility, you can also provide the table-name
with no quotes at all. The last example below shows the table name preceded
by the desired schema name. e.g. 'public.tablename1. :create-table does not
accept the table-name as a variable.

#+BEGIN_SRC lisp
(query (:create-table 'distributors-in-hell
         ((did :type (or integer db-null)))))

(query (:create-table (distributors-in-hell)
         ((did :type (or integer db-null)))))

(query (:create-table ("distributors-in-hell")
         ((did :type (or integer db-null)))))

(query (:create-table 'public.distributors-in-hell
         ((did :type (or integer db-null)))))
#+END_SRC

Using the name wrapped in a form provides the opportunity to add additional
qualifiers - if-not-exists, temp, and unlogged.

#+BEGIN_SRC lisp
(query (:create-table (:if-not-exists 'distributors-in-hell)
          ((did :type (or integer db-null)))))
#+END_SRC

*** Temporary and Unlogged Tables
    :PROPERTIES:
    :ID:       01951f3c-0e2b-4567-8545-44e0584d0fa7
    :CUSTOM_ID: 034f548e-0318-40fc-90c5-63fb310936e4
    :END:
Temporary tables exists only for the duration of the session and are unlogged.
To create them using s-sql in postmodern, the first parameter to :create-table
should be a form where the first atom in the form is the keyword :temp., then
the name of the table. You can optionally use the :if-not-exists keyword in a
either sequentially or in a subform wrapping the name of the temporary table.
E.g.

#+BEGIN_SRC lisp
(query (:create-table (:temp 'distributors-in-hell)
         ((did :type (or integer db-null)))))

(query (:create-table (:temp (:if-not-exists 'distributors-in-hell))
         ((did :type (or integer db-null)))))

(query (:create-table (:temp :if-not-exists 'distributors-in-hell)
         ((did :type (or integer db-null)))))
#+END_SRC

Unlogged tables do not have their data written to the write-ahead log. As a
result they are faster, but not crash safe. Any indexes created on an unlogged
table are unlogged as well. The parameter signature is similar to a temporary
table. E.g.

#+BEGIN_SRC lisp
(query (:create-table (:unlogged 'distributors-in-hell)
         ((did :type (or integer db-null)))))
#+END_SRC

** Using Identity Columns
   :PROPERTIES:
   :ID:       675aaa13-4be0-458f-b004-789fac521dc4
   :CUSTOM_ID: df4fd2b0-1928-4fa9-9c70-c2060cdec5ff
   :END:
Postgresql version 10 added identity columns. These are auto-incrementing
columns that use the standard SQL syntax instead of the serial and bigserial
datatypes which are still available, but are not SQL standard syntax. The
serial and bigserial datatypes also generate sequences that may have different
usage permissions which can be problematic if you need to make changes to the
sequence.

There are two keyword alternatives that need to be considered:

- :generated-as-identity-by-default (or more simply :identity-by-default)
- :generated-as-identity-always (or more simply :identity-always)

The difference between the two alternatives is that if you try to insert or
update a value in the column and the generated-always option is chosen,
postgresql will raise an error. If you use the by-default option, postgresql
will use your value rather than the automatically generated value.

Note: The data type used for identity columns must be one of smallint, int or bigint.

#+BEGIN_SRC lisp
(query (:create-table 'color
         ((color-id :type int :generated-as-identity-always t)
          (color-name :type varchar))))

(query (:create-table 'color
         ((color-id :type int :generated-as-identity-by-default t)
          (color-name :type varchar))))

(query (:create-table 'color
         ((color-id :type int :identity-always t)
          (color-name :type varchar))))

(query (:create-table 'color
         ((color-id :type int :identity-by-default t)
          (color-name :type varchar))))
#+END_SRC

** Array Columns
   :PROPERTIES:
   :ID:       04eff0b7-ac42-40f9-887c-f4fcff7cc4d5
   :CUSTOM_ID: 3b09fa31-255b-4769-9d8f-085201e66a02
   :END:
The following shows the creation of a table with a two dimensional array
#+BEGIN_SRC lisp
(query (:create-table 'array-int
       ((vector :type (or int[][] db-null)))))
#+END_SRC

** Check Constraints
   :PROPERTIES:
   :ID:       a62455db-395a-4757-b573-f7cd2a267bd0
   :CUSTOM_ID: 205f09d2-9357-4512-949a-3dcaaae6808f
   :END:
You can put a contraint on a table row that specifies values must meet
certain requirements. In the following examples, the first puts a check
constraint on a row, the second places at check constraint at the table
level.

#+BEGIN_SRC lisp
(query (:create-table 'distributors
         ((did :type (or integer db-null) :check (:> 'did 100))
          (name :type (or (varchar 40) db-null)))))

(query (:create-table 'distributors
         ((did :type (or integer db-null))
          (name :type (or (varchar 40) db-null)))
         (:constraint con1 :check (:and (:> 'did 100) (:<> 'name "")))))
#+END_SRC

