doc/create-tables.html

<div id="outline-container-efb71d2a-2318-47d3-8f04-b5fe2172178d" class="outline-3">
<h3 id="efb71d2a-2318-47d3-8f04-b5fe2172178d">Table Names Parameter</h3>
<div class="outline-text-3" id="text-efb71d2a-2318-47d3-8f04-b5fe2172178d">
<p>
The following discussion on table names is the same for both :create-table
or :create-extended table.
</p>

<p>
Create-table works with either the simple name for the table parameter or the
name can be wrapped in a form. There are a few acceptable ways to pass the
table-name parameters. We recommend a single quote as in the first example
below, but for backwards compatibility, you can also provide the table-name
with no quotes at all. The last example below shows the table name preceded
by the desired schema name. e.g. 'public.tablename1. :create-table does not
accept the table-name as a variable.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-table</span> 'distributors-in-hell
         ((did <span style="color: #23d7d7;">:type</span> (or integer db-null)))))

(query (<span style="color: #23d7d7;">:create-table</span> (distributors-in-hell)
         ((did <span style="color: #23d7d7;">:type</span> (or integer db-null)))))

(query (<span style="color: #23d7d7;">:create-table</span> (<span style="color: #e67128;">"distributors-in-hell"</span>)
         ((did <span style="color: #23d7d7;">:type</span> (or integer db-null)))))

(query (<span style="color: #23d7d7;">:create-table</span> 'public.distributors-in-hell
         ((did <span style="color: #23d7d7;">:type</span> (or integer db-null)))))
</pre>
</div>

<p>
Using the name wrapped in a form provides the opportunity to add additional
qualifiers - if-not-exists, temp, and unlogged.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-table</span> (<span style="color: #23d7d7;">:if-not-exists</span> 'distributors-in-hell)
          ((did <span style="color: #23d7d7;">:type</span> (or integer db-null)))))
</pre>
</div>
</div>

<div id="outline-container-034f548e-0318-40fc-90c5-63fb310936e4" class="outline-4">
<h4 id="034f548e-0318-40fc-90c5-63fb310936e4">Temporary and Unlogged Tables</h4>
<div class="outline-text-4" id="text-034f548e-0318-40fc-90c5-63fb310936e4">
<p>
Temporary tables exists only for the duration of the session and are unlogged.
To create them using s-sql in postmodern, the first parameter to :create-table
should be a form where the first atom in the form is the keyword :temp., then
the name of the table. You can optionally use the :if-not-exists keyword in a
either sequentially or in a subform wrapping the name of the temporary table.
E.g.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-table</span> (<span style="color: #23d7d7;">:temp</span> 'distributors-in-hell)
         ((did <span style="color: #23d7d7;">:type</span> (or integer db-null)))))

(query (<span style="color: #23d7d7;">:create-table</span> (<span style="color: #23d7d7;">:temp</span> (<span style="color: #23d7d7;">:if-not-exists</span> 'distributors-in-hell))
         ((did <span style="color: #23d7d7;">:type</span> (or integer db-null)))))

(query (<span style="color: #23d7d7;">:create-table</span> (<span style="color: #23d7d7;">:temp</span> <span style="color: #23d7d7;">:if-not-exists</span> 'distributors-in-hell)
         ((did <span style="color: #23d7d7;">:type</span> (or integer db-null)))))
</pre>
</div>

<p>
Unlogged tables do not have their data written to the write-ahead log. As a
result they are faster, but not crash safe. Any indexes created on an unlogged
table are unlogged as well. The parameter signature is similar to a temporary
table. E.g.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-table</span> (<span style="color: #23d7d7;">:unlogged</span> 'distributors-in-hell)
         ((did <span style="color: #23d7d7;">:type</span> (or integer db-null)))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-df4fd2b0-1928-4fa9-9c70-c2060cdec5ff" class="outline-3">
<h3 id="df4fd2b0-1928-4fa9-9c70-c2060cdec5ff">Using Identity Columns</h3>
<div class="outline-text-3" id="text-df4fd2b0-1928-4fa9-9c70-c2060cdec5ff">
<p>
Postgresql version 10 added identity columns. These are auto-incrementing
columns that use the standard SQL syntax instead of the serial and bigserial
datatypes which are still available, but are not SQL standard syntax. The
serial and bigserial datatypes also generate sequences that may have different
usage permissions which can be problematic if you need to make changes to the
sequence.
</p>

<p>
There are two keyword alternatives that need to be considered:
</p>

<ul class="org-ul">
<li>:generated-as-identity-by-default (or more simply :identity-by-default)</li>
<li>:generated-as-identity-always (or more simply :identity-always)</li>
</ul>

<p>
The difference between the two alternatives is that if you try to insert or
update a value in the column and the generated-always option is chosen,
postgresql will raise an error. If you use the by-default option, postgresql
will use your value rather than the automatically generated value.
</p>

<p>
Note: The data type used for identity columns must be one of smallint, int or bigint.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-table</span> 'color
         ((color-id <span style="color: #23d7d7;">:type</span> int <span style="color: #23d7d7;">:generated-as-identity-always</span> t)
          (color-name <span style="color: #23d7d7;">:type</span> varchar))))

(query (<span style="color: #23d7d7;">:create-table</span> 'color
         ((color-id <span style="color: #23d7d7;">:type</span> int <span style="color: #23d7d7;">:generated-as-identity-by-default</span> t)
          (color-name <span style="color: #23d7d7;">:type</span> varchar))))

(query (<span style="color: #23d7d7;">:create-table</span> 'color
         ((color-id <span style="color: #23d7d7;">:type</span> int <span style="color: #23d7d7;">:identity-always</span> t)
          (color-name <span style="color: #23d7d7;">:type</span> varchar))))

(query (<span style="color: #23d7d7;">:create-table</span> 'color
         ((color-id <span style="color: #23d7d7;">:type</span> int <span style="color: #23d7d7;">:identity-by-default</span> t)
          (color-name <span style="color: #23d7d7;">:type</span> varchar))))
</pre>
</div>
</div>
</div>

<div id="outline-container-3b09fa31-255b-4769-9d8f-085201e66a02" class="outline-3">
<h3 id="3b09fa31-255b-4769-9d8f-085201e66a02">Array Columns</h3>
<div class="outline-text-3" id="text-3b09fa31-255b-4769-9d8f-085201e66a02">
<p>
The following shows the creation of a table with a two dimensional array
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-table</span> 'array-int
       ((vector <span style="color: #23d7d7;">:type</span> (or int[][] db-null)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-205f09d2-9357-4512-949a-3dcaaae6808f" class="outline-3">
<h3 id="205f09d2-9357-4512-949a-3dcaaae6808f">Check Constraints</h3>
<div class="outline-text-3" id="text-205f09d2-9357-4512-949a-3dcaaae6808f">
<p>
You can put a contraint on a table row that specifies values must meet
certain requirements. In the following examples, the first puts a check
constraint on a row, the second places at check constraint at the table
level.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-table</span> 'distributors
         ((did <span style="color: #23d7d7;">:type</span> (or integer db-null) <span style="color: #23d7d7;">:check</span> (<span style="color: #23d7d7;">:&gt;</span> 'did 100))
          (name <span style="color: #23d7d7;">:type</span> (or (varchar 40) db-null)))))

(query (<span style="color: #23d7d7;">:create-table</span> 'distributors
         ((did <span style="color: #23d7d7;">:type</span> (or integer db-null))
          (name <span style="color: #23d7d7;">:type</span> (or (varchar 40) db-null)))
         (<span style="color: #23d7d7;">:constraint</span> con1 <span style="color: #23d7d7;">:check</span> (<span style="color: #23d7d7;">:and</span> (<span style="color: #23d7d7;">:&gt;</span> 'did 100) (<span style="color: #23d7d7;">:&lt;&gt;</span> 'name <span style="color: #e67128;">""</span>)))))
</pre>
</div>
</div>
</div>
