doc/create-tables.org
** Unique Constraints
   :PROPERTIES:
   :ID:       87783379-e1bf-485a-865e-05aa539ec871
   :CUSTOM_ID: e2ed3fbc-6193-4db8-b2ea-cf29d0fe849e
   :END:
You can ensure that a column or a combination of columns is unique
without making that column or columns the primary key for the table.

The first example sets a unique constraint at the column level of email,
the second example sets a unique constraint at the table level.

Please note the need to set :unique to t in the column constraint
version.

#+BEGIN_SRC lisp
(query (:create-table 'person
       ((id :type serial :primary-key t)
        (first-name :type (varchar 50))
        (last-name :type (varchar 50))
        (email :type (varchar 50) :unique t))))

(query (:create-table 'films
         ((code :type (or (string 5) db-null))
          (title :type (or (varchar 40) db-null))
          (did :type (or integer db-null))
          (date-prod :type (or date db-null))
          (kind :type (or (varchar 10) db-null))
          (len :type (or interval db-null) :interval :hour-to-minute))
         (:constraint production :unique 'date-prod)))
#+END_SRC

This can get more complex if so desired. See the following example
from the postgresql documentation, translated into s-sql. This level of
complexity, however, requires the :create-extended-table method.

#+BEGIN_SRC lisp
(query (:create-extended-table 'distributors
         ((did :type (or integer db-null))
          (name :type (or (varchar 40) db-null)))
         ((:unique did :with (:= 'fillfactor 70)))))
#+END_SRC
In case you are wondering, fillfactor is a storage parameter described in the
postgresql documentation as:

"The fillfactor for a table is a percentage between 10 and 100. 100 (complete
packing) is the default. When a smaller fillfactor is specified, INSERT
operations pack table pages only to the indicated percentage; the remaining
space on each page is reserved for updating rows on that page. This gives
UPDATE a chance to place the updated copy of a row on the same page as the
original, which is more efficient than placing it on a different page. For a
table whose entries are never updated, complete packing is the best choice,
but in heavily updated tables smaller fillfactors are appropriate. This
parameter cannot be set for TOAST tables."

** Timestamps with and without timezones
   :PROPERTIES:
   :ID:       08e399fb-51d0-425a-9349-c1400fed8f76
   :CUSTOM_ID: 7d0b525b-827f-41db-8523-e62da8fbe52b
   :END:
Ah, the bane of many programmers' existence - dates and times.
At least the table creation is fairly straightforward.

The following examples are fairly self explanatory.
#+BEGIN_SRC
(query (:create-table 'account-role
         ((user-id :type integer)
          (role-id :type integer)
          (grant-date :type (or timestamp-without-time-zone db-null)))))

(query (:create-table 'account-role
         ((user-id :type integer)
          (role-id :type integer)
          (grant-date :type (or timestamp-with-time-zone db-null)))))

(query (:create-table 'account-role
         ((user-id :type integer)
          (role-id :type integer)
          (grant-date :type (or timestamptz db-null)))))

(query (:create-table 'account-role
         ((user-id :type integer)
          (role-id :type integer)
          (grant-date :type (or timestamp db-null)))))

(query (:create-table 'account-role
         ((user-id :type integer)
          (role-id :type integer)
          (grant-date :type (or time db-null)))))
#+END_SRC


** Adding Foreign Keys
   :PROPERTIES:
   :ID:       e65bef5a-bae8-4b47-a66f-37f6e71d9fdb
   :CUSTOM_ID: 05423b5d-c101-4244-bc7e-5b05e257d03a
   :END:
Foreign keys are a constraint. If a column is set with a foreign key referencing
another table, Postgresql will prevent you from inserting any value in that row
unless there is a corresponding value in the foreign table. In other words, if
you have a countries table with a region-id foreign key referencing a regions
table, you cannot insert a country with a reference to a region-id or region-name
unless that region-id or region-name already exists in the regions table. This
is part of maintaining data integrity.

There are a few different ways to add foreign keys in postgresql when defining
a table.

