doc/create-tables.html

<div id="outline-container-e2ed3fbc-6193-4db8-b2ea-cf29d0fe849e" class="outline-3">
<h3 id="e2ed3fbc-6193-4db8-b2ea-cf29d0fe849e">Unique Constraints</h3>
<div class="outline-text-3" id="text-e2ed3fbc-6193-4db8-b2ea-cf29d0fe849e">
<p>
You can ensure that a column or a combination of columns is unique
without making that column or columns the primary key for the table.
</p>

<p>
The first example sets a unique constraint at the column level of email,
the second example sets a unique constraint at the table level.
</p>

<p>
Please note the need to set :unique to t in the column constraint
version.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-table</span> 'person
       ((id <span style="color: #23d7d7;">:type</span> serial <span style="color: #23d7d7;">:primary-key</span> t)
        (first-name <span style="color: #23d7d7;">:type</span> (varchar 50))
        (last-name <span style="color: #23d7d7;">:type</span> (varchar 50))
        (email <span style="color: #23d7d7;">:type</span> (varchar 50) <span style="color: #23d7d7;">:unique</span> t))))

(query (<span style="color: #23d7d7;">:create-table</span> 'films
         ((code <span style="color: #23d7d7;">:type</span> (or (string 5) db-null))
          (title <span style="color: #23d7d7;">:type</span> (or (varchar 40) db-null))
          (did <span style="color: #23d7d7;">:type</span> (or integer db-null))
          (date-prod <span style="color: #23d7d7;">:type</span> (or date db-null))
          (kind <span style="color: #23d7d7;">:type</span> (or (varchar 10) db-null))
          (len <span style="color: #23d7d7;">:type</span> (or interval db-null) <span style="color: #23d7d7;">:interval</span> <span style="color: #23d7d7;">:hour-to-minute</span>))
         (<span style="color: #23d7d7;">:constraint</span> production <span style="color: #23d7d7;">:unique</span> 'date-prod)))
</pre>
</div>

<p>
This can get more complex if so desired. See the following example
from the postgresql documentation, translated into s-sql. This level of
complexity, however, requires the :create-extended-table method.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-extended-table</span> 'distributors
         ((did <span style="color: #23d7d7;">:type</span> (or integer db-null))
          (name <span style="color: #23d7d7;">:type</span> (or (varchar 40) db-null)))
         ((<span style="color: #23d7d7;">:unique</span> did <span style="color: #23d7d7;">:with</span> (<span style="color: #23d7d7;">:=</span> 'fillfactor 70)))))
</pre>
</div>
<p>
In case you are wondering, fillfactor is a storage parameter described in the
postgresql documentation as:
</p>

<p>
"The fillfactor for a table is a percentage between 10 and 100. 100 (complete
packing) is the default. When a smaller fillfactor is specified, INSERT
operations pack table pages only to the indicated percentage; the remaining
space on each page is reserved for updating rows on that page. This gives
UPDATE a chance to place the updated copy of a row on the same page as the
original, which is more efficient than placing it on a different page. For a
table whose entries are never updated, complete packing is the best choice,
but in heavily updated tables smaller fillfactors are appropriate. This
parameter cannot be set for TOAST tables."
</p>
</div>
</div>

<div id="outline-container-7d0b525b-827f-41db-8523-e62da8fbe52b" class="outline-3">
<h3 id="7d0b525b-827f-41db-8523-e62da8fbe52b">Timestamps with and without timezones</h3>
<div class="outline-text-3" id="text-7d0b525b-827f-41db-8523-e62da8fbe52b">
<p>
Ah, the bane of many programmers' existence - dates and times.
At least the table creation is fairly straightforward.
</p>

<p>
The following examples are fairly self explanatory.
</p>
<pre class="example">
(query (:create-table 'account-role
         ((user-id :type integer)
          (role-id :type integer)
          (grant-date :type (or timestamp-without-time-zone db-null)))))

(query (:create-table 'account-role
         ((user-id :type integer)
          (role-id :type integer)
          (grant-date :type (or timestamp-with-time-zone db-null)))))

(query (:create-table 'account-role
         ((user-id :type integer)
          (role-id :type integer)
          (grant-date :type (or timestamptz db-null)))))

(query (:create-table 'account-role
         ((user-id :type integer)
          (role-id :type integer)
          (grant-date :type (or timestamp db-null)))))

(query (:create-table 'account-role
         ((user-id :type integer)
          (role-id :type integer)
          (grant-date :type (or time db-null)))))
</pre>
</div>
</div>


<div id="outline-container-05423b5d-c101-4244-bc7e-5b05e257d03a" class="outline-3">
<h3 id="05423b5d-c101-4244-bc7e-5b05e257d03a">Adding Foreign Keys</h3>
<div class="outline-text-3" id="text-05423b5d-c101-4244-bc7e-5b05e257d03a">
<p>
Foreign keys are a constraint. If a column is set with a foreign key referencing
another table, Postgresql will prevent you from inserting any value in that row
unless there is a corresponding value in the foreign table. In other words, if
you have a countries table with a region-id foreign key referencing a regions
table, you cannot insert a country with a reference to a region-id or region-name
unless that region-id or region-name already exists in the regions table. This
is part of maintaining data integrity.
</p>

<p>
There are a few different ways to add foreign keys in postgresql when defining
a table.
</p>
</div>
