doc/create-tables.org
*** Defining Foreign Keys at the Column Level
    :PROPERTIES:
    :ID:       02e06fce-1b41-4edd-aa1d-f9b3cc665d00
    :CUSTOM_ID: 5bc3ebb3-b34c-4490-b4d4-a3d404b636a7
    :END:

First with foreign key on the column. Use the keyword :references and specify
the table name  and the relevant column within the subform. You will see why
the subform in a minute.
#+BEGIN_SRC lisp
(query (:create-table 'so-items
          ((item-id :type integer)
           (so-id :type (or integer db-null) :references ((so-headers id)))
           (product-id :type (or integer db-null))
           (qty :type (or integer db-null))
           (net-price :type (or numeric db-null)))
          (:primary-key item-id so-id)))
#+END_SRC

If the foreign key references a group of columns in the foreign table, those
fit into that same subform.

#+BEGIN_SRC lisp
(query (:create-table 'so-items
          ((item-id :type integer)
           (so-id :type (or integer db-null) :references ((so-headers id p1 p2)))
           (product-id :type (or integer db-null))
           (qty :type (or integer db-null))
           (net-price :type (or numeric db-null)))
          (:primary-key item-id so-id)))
#+END_SRC

You can specify the actions to be taken if a row in the foreign table is
deleted or updated. Per the postgresql documentation:

"... when the data in the referenced columns is changed, certain actions are
performed on the data in this table's columns. The ON DELETE clause specifies
the action to perform when a referenced row in the referenced table is being
deleted. Likewise, the ON UPDATE clause specifies the action to perform when
a referenced column in the referenced table is being updated to a new value.
If the row is updated, but the referenced column is not actually changed, no
action is done. Referential actions other than the NO ACTION check cannot be
deferred, even if the constraint is declared deferrable. There are the
following possible actions for each clause:

-  NO ACTION
Produce an error indicating that the deletion or update would create a foreign
key constraint violation. If the constraint is deferred, this error will be
produced at constraint check time if there still exist any referencing rows.
This is the default action in postgresql but the default in postmodern is
restrict.

- RESTRICT
Produce an error indicating that the deletion or update would create a foreign
key constraint violation. This is the same as NO ACTION except that the check
is not deferrable.

- CASCADE
Delete any rows referencing the deleted row, or update the values of the
referencing column(s) to the new values of the referenced columns, respectively.

- SET NULL
Set the referencing column(s) to null.

-  SET DEFAULT
Set the referencing column(s) to their default values. (There must be a row in
the referenced table matching the default values, if they are not null, or
the operation will fail.)

If the referenced column(s) are changed frequently, it might be wise to add an
index to the referencing column(s) so that referential actions associated with
the foreign key constraint can be performed more efficiently."

So now examples with specifying the on-delete and on-update actions.
#+BEGIN_SRC lisp
(query (:create-table 'so-items
         ((item-id :type integer)
          (so-id :type (or integer db-null)
                 :references ((so-headers id) :no-action :no-action))
          (product-id :type (or integer db-null))
          (qty :type (or integer db-null))
          (net-price :type (or numeric db-null)))
         (:primary-key item-id so-id)))
#+END_SRC

*** Defining Foreign Keys at the Table Level
    :PROPERTIES:
    :ID:       43ffc1bf-5497-41f2-af15-2c3128745b55
    :CUSTOM_ID: 7d033701-5e20-43b7-9142-2cf5c1e50317
    :END:
Instead of specifying the foreign keys at the column level, you can specify
them at the table level, but of course that means you have to additionally
specify which column in the current table is a foreign key.

The following example creates a named constraint and a foreign key at column
role-id with a single column in the foreign table. The first example uses the
default actions for on-delete and on-default. The second example shows
non-default actions specified.

#+BEGIN_SRC lisp
(query (:create-table 'account-role
         ((user-id :type integer)
          (role-id :type integer)
          (grant-date :type (or timestamp-without-time-zone db-null)))
         (:primary-key user-id role-id)
         (:constraint account-role-role-id-fkey
                      :foreign-key (role-id) (role role-id))))


(query (:create-table 'account-role
         ((user-id :type integer)
          (role-id :type integer)
          (grant-date :type (or timestamp-without-time-zone db-null)))
         (:primary-key user-id role-id)
         (:constraint account-role-role-id-fkey
                      :foreign-key (role-id) (role role-id) :no-action :no-action)))
#+END_SRC
Additional foreign keys can easily be added:
#+BEGIN_SRC lisp
(query (:create-table 'account-role
         ((user-id :type integer)
          (role-id :type integer)
          (grant-date :type (or timestamp-without-time-zone db-null)))
         (:primary-key user-id role-id)
         (:constraint account-role-role-id-fkey
                      :foreign-key (role-id) (role role-id))
         (:constraint account-role-user-id-fkey
                      :foreign-key (user-id) (users user-id))))
#+END_SRC
** Using Tablespaces
   :PROPERTIES:
   :ID:       a9eb931c-2b9f-4bd1-a17d-e46d891d667d
   :CUSTOM_ID: 1aff79ef-749e-4229-82e4-81dceabb72b5
   :END:
Tablespaces require use of the create-extended-table method. Note that the
create-extended-table method has a slightly different signature. It expects
a table name and two or three forms. The first form relates to the columns,
the second form relates to table level constraints. The third form, if present,
refers to specific postgresql storage options such as tablespaces and
partitions and storage parameters. This is only partially implemented.

Tablespaces are documented at https://www.postgresql.org/docs/current/manage-ag-tablespaces.html
#+BEGIN_SRC lisp
(query (:create-extended-table 'cinemas
       ((id :type serial) (name :type (or text db-null))
        (location :type (or text db-null)))
       ()
       ((:tablespace diskvol1))))
#+END_SRC

