doc/create-tables.html

<div id="outline-container-5bc3ebb3-b34c-4490-b4d4-a3d404b636a7" class="outline-4">
<h4 id="5bc3ebb3-b34c-4490-b4d4-a3d404b636a7">Defining Foreign Keys at the Column Level</h4>
<div class="outline-text-4" id="text-5bc3ebb3-b34c-4490-b4d4-a3d404b636a7">
<p>
First with foreign key on the column. Use the keyword :references and specify
the table name  and the relevant column within the subform. You will see why
the subform in a minute.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-table</span> 'so-items
          ((item-id <span style="color: #23d7d7;">:type</span> integer)
           (so-id <span style="color: #23d7d7;">:type</span> (or integer db-null) <span style="color: #23d7d7;">:references</span> ((so-headers id)))
           (product-id <span style="color: #23d7d7;">:type</span> (or integer db-null))
           (qty <span style="color: #23d7d7;">:type</span> (or integer db-null))
           (net-price <span style="color: #23d7d7;">:type</span> (or numeric db-null)))
          (<span style="color: #23d7d7;">:primary-key</span> item-id so-id)))
</pre>
</div>

<p>
If the foreign key references a group of columns in the foreign table, those
fit into that same subform.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-table</span> 'so-items
          ((item-id <span style="color: #23d7d7;">:type</span> integer)
           (so-id <span style="color: #23d7d7;">:type</span> (or integer db-null) <span style="color: #23d7d7;">:references</span> ((so-headers id p1 p2)))
           (product-id <span style="color: #23d7d7;">:type</span> (or integer db-null))
           (qty <span style="color: #23d7d7;">:type</span> (or integer db-null))
           (net-price <span style="color: #23d7d7;">:type</span> (or numeric db-null)))
          (<span style="color: #23d7d7;">:primary-key</span> item-id so-id)))
</pre>
</div>

<p>
You can specify the actions to be taken if a row in the foreign table is
deleted or updated. Per the postgresql documentation:
</p>

<p>
"&#x2026; when the data in the referenced columns is changed, certain actions are
performed on the data in this table's columns. The ON DELETE clause specifies
the action to perform when a referenced row in the referenced table is being
deleted. Likewise, the ON UPDATE clause specifies the action to perform when
a referenced column in the referenced table is being updated to a new value.
If the row is updated, but the referenced column is not actually changed, no
action is done. Referential actions other than the NO ACTION check cannot be
deferred, even if the constraint is declared deferrable. There are the
following possible actions for each clause:
</p>

<ul class="org-ul">
<li>NO ACTION</li>
</ul>
<p>
Produce an error indicating that the deletion or update would create a foreign
key constraint violation. If the constraint is deferred, this error will be
produced at constraint check time if there still exist any referencing rows.
This is the default action in postgresql but the default in postmodern is
restrict.
</p>

<ul class="org-ul">
<li>RESTRICT</li>
</ul>
<p>
Produce an error indicating that the deletion or update would create a foreign
key constraint violation. This is the same as NO ACTION except that the check
is not deferrable.
</p>

<ul class="org-ul">
<li>CASCADE</li>
</ul>
<p>
Delete any rows referencing the deleted row, or update the values of the
referencing column(s) to the new values of the referenced columns, respectively.
</p>

<ul class="org-ul">
<li>SET NULL</li>
</ul>
<p>
Set the referencing column(s) to null.
</p>

<ul class="org-ul">
<li>SET DEFAULT</li>
</ul>
<p>
Set the referencing column(s) to their default values. (There must be a row in
the referenced table matching the default values, if they are not null, or
the operation will fail.)
</p>

<p>
If the referenced column(s) are changed frequently, it might be wise to add an
index to the referencing column(s) so that referential actions associated with
the foreign key constraint can be performed more efficiently."
</p>

<p>
So now examples with specifying the on-delete and on-update actions.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-table</span> 'so-items
         ((item-id <span style="color: #23d7d7;">:type</span> integer)
          (so-id <span style="color: #23d7d7;">:type</span> (or integer db-null)
                 <span style="color: #23d7d7;">:references</span> ((so-headers id) <span style="color: #23d7d7;">:no-action</span> <span style="color: #23d7d7;">:no-action</span>))
          (product-id <span style="color: #23d7d7;">:type</span> (or integer db-null))
          (qty <span style="color: #23d7d7;">:type</span> (or integer db-null))
          (net-price <span style="color: #23d7d7;">:type</span> (or numeric db-null)))
         (<span style="color: #23d7d7;">:primary-key</span> item-id so-id)))
</pre>
</div>
</div>
</div>

<div id="outline-container-7d033701-5e20-43b7-9142-2cf5c1e50317" class="outline-4">
<h4 id="7d033701-5e20-43b7-9142-2cf5c1e50317">Defining Foreign Keys at the Table Level</h4>
<div class="outline-text-4" id="text-7d033701-5e20-43b7-9142-2cf5c1e50317">
<p>
Instead of specifying the foreign keys at the column level, you can specify
them at the table level, but of course that means you have to additionally
specify which column in the current table is a foreign key.
</p>

<p>
The following example creates a named constraint and a foreign key at column
role-id with a single column in the foreign table. The first example uses the
default actions for on-delete and on-default. The second example shows
non-default actions specified.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-table</span> 'account-role
         ((user-id <span style="color: #23d7d7;">:type</span> integer)
          (role-id <span style="color: #23d7d7;">:type</span> integer)
          (grant-date <span style="color: #23d7d7;">:type</span> (or timestamp-without-time-zone db-null)))
         (<span style="color: #23d7d7;">:primary-key</span> user-id role-id)
         (<span style="color: #23d7d7;">:constraint</span> account-role-role-id-fkey
                      <span style="color: #23d7d7;">:foreign-key</span> (role-id) (role role-id))))


(query (<span style="color: #23d7d7;">:create-table</span> 'account-role
         ((user-id <span style="color: #23d7d7;">:type</span> integer)
          (role-id <span style="color: #23d7d7;">:type</span> integer)
          (grant-date <span style="color: #23d7d7;">:type</span> (or timestamp-without-time-zone db-null)))
         (<span style="color: #23d7d7;">:primary-key</span> user-id role-id)
         (<span style="color: #23d7d7;">:constraint</span> account-role-role-id-fkey
                      <span style="color: #23d7d7;">:foreign-key</span> (role-id) (role role-id) <span style="color: #23d7d7;">:no-action</span> <span style="color: #23d7d7;">:no-action</span>)))
</pre>
</div>
<p>
Additional foreign keys can easily be added:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-table</span> 'account-role
         ((user-id <span style="color: #23d7d7;">:type</span> integer)
          (role-id <span style="color: #23d7d7;">:type</span> integer)
          (grant-date <span style="color: #23d7d7;">:type</span> (or timestamp-without-time-zone db-null)))
         (<span style="color: #23d7d7;">:primary-key</span> user-id role-id)
         (<span style="color: #23d7d7;">:constraint</span> account-role-role-id-fkey
                      <span style="color: #23d7d7;">:foreign-key</span> (role-id) (role role-id))
         (<span style="color: #23d7d7;">:constraint</span> account-role-user-id-fkey
                      <span style="color: #23d7d7;">:foreign-key</span> (user-id) (users user-id))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-1aff79ef-749e-4229-82e4-81dceabb72b5" class="outline-3">
<h3 id="1aff79ef-749e-4229-82e4-81dceabb72b5">Using Tablespaces</h3>
<div class="outline-text-3" id="text-1aff79ef-749e-4229-82e4-81dceabb72b5">
<p>
Tablespaces require use of the create-extended-table method. Note that the
create-extended-table method has a slightly different signature. It expects
a table name and two or three forms. The first form relates to the columns,
the second form relates to table level constraints. The third form, if present,
refers to specific postgresql storage options such as tablespaces and
partitions and storage parameters. This is only partially implemented.
</p>

<p>
Tablespaces are documented at <a href="https://www.postgresql.org/docs/current/manage-ag-tablespaces.html">https://www.postgresql.org/docs/current/manage-ag-tablespaces.html</a>
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-extended-table</span> 'cinemas
       ((id <span style="color: #23d7d7;">:type</span> serial) (name <span style="color: #23d7d7;">:type</span> (or text db-null))
        (location <span style="color: #23d7d7;">:type</span> (or text db-null)))
       ()
       ((<span style="color: #23d7d7;">:tablespace</span> diskvol1))))
</pre>
</div>
</div>
</div>
