doc/create-tables.org
** Partitions (not fully implemented)
   :PROPERTIES:
   :ID:       2bc90e7a-1a03-4d15-a2fd-cb11d83de8a1
   :CUSTOM_ID: 015c6b92-dd5f-400b-bd8d-d2d08e76a166
   :END:
The following are two very simple examples of use of partitions. You should
not consider partition functionality to be fully implemented past these
examples.

#+BEGIN_SRC lisp
(query (:create-extended-table 'measurement
         ((logdate :type date)
          (peaktemp :type (or integer db-null))
          (unitsales :type (or integer db-null)))
         ()
         ((:partition-by-range 'logdate))))

;; Create a range partitioned table with multiple columns in the partition key:

(query (:create-extended-table 'measurement-year-month
         ((logdate :type date)
          (peaktemp :type (or integer db-null))
          (unitsales :type (or integer db-null)))
         ()
         ((:partition-by-range (:extract 'year 'logdate)(:extract 'month 'logdate)))))
#+END_SRC

* Table Creation With Dao Classes
 See: [[file:dao-classes.html#table-definition][Creating Tables using dao classes]]
