doc/create-tables.html

<div id="outline-container-015c6b92-dd5f-400b-bd8d-d2d08e76a166" class="outline-3">
<h3 id="015c6b92-dd5f-400b-bd8d-d2d08e76a166">Partitions (not fully implemented)</h3>
<div class="outline-text-3" id="text-015c6b92-dd5f-400b-bd8d-d2d08e76a166">
<p>
The following are two very simple examples of use of partitions. You should
not consider partition functionality to be fully implemented past these
examples.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-extended-table</span> 'measurement
         ((logdate <span style="color: #23d7d7;">:type</span> date)
          (peaktemp <span style="color: #23d7d7;">:type</span> (or integer db-null))
          (unitsales <span style="color: #23d7d7;">:type</span> (or integer db-null)))
         ()
         ((<span style="color: #23d7d7;">:partition-by-range</span> 'logdate))))

<span style="color: #74af68;">;; </span><span style="color: #74af68;">Create a range partitioned table with multiple columns in the partition key:</span>

(query (<span style="color: #23d7d7;">:create-extended-table</span> 'measurement-year-month
         ((logdate <span style="color: #23d7d7;">:type</span> date)
          (peaktemp <span style="color: #23d7d7;">:type</span> (or integer db-null))
          (unitsales <span style="color: #23d7d7;">:type</span> (or integer db-null)))
         ()
         ((<span style="color: #23d7d7;">:partition-by-range</span> (<span style="color: #23d7d7;">:extract</span> 'year 'logdate)(<span style="color: #23d7d7;">:extract</span> 'month 'logdate)))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6b881c7" class="outline-2">
<h2 id="org6b881c7">Table Creation With Dao Classes</h2>
<div class="outline-text-2" id="text-org6b881c7">
<p>
See: <a href="dao-classes.html#table-definition">Creating Tables using dao classes</a>
</p>
</div>
</div>
</div>
</body>
</html>
